//KC03XXXZ JOB CLASS=A,MSGCLASS=O,MSGLEVEL=(1,1),NOTIFY=&SYSUID,
//             TIME=(,5)
//************************************
//* EJECUCION PROGRAMA PGMASIN6      *
//************************************
//STEP1    EXEC PGM=PGM3CXXX
//STEPLIB  DD DSN=KC03XXX.CURSOS.PGMLIB,DISP=SHR
//XXXXXXX  DD DSN=KC03XXX.ALU9999.CURSOS.CLIENTE,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//*
//
