       IDENTIFICATION DIVISION.                                         00010002
       PROGRAM-ID. HOLMUNDO.                                            00020002
       PROCEDURE DIVISION.                                              00030002
           DISPLAY 'HOLA MUNDO, BY KC03C7C'.                             00040003
           STOP RUN.                                                    00060002
