       IDENTIFICATION DIVISION.                                         
       PROGRAM-ID. PGMSIN11.                                            
                                                                        
      **************************************************                
      *                                                *                
      *  SINCRONICA 11: CORTE CONTROL                  *                
      *  ============================                  *                
      *                                                *                
      *  - HACE UN  CORTE DE CONTROL POR WS-SUC-NRO    *                
      *  - Y OTRO CORTE DE CONTROL POR WS-SUC-TIPC1    *                
      *                                                *                
      *                                                *                
      **************************************************                
                                                                        
       ENVIRONMENT DIVISION.                                            
       CONFIGURATION SECTION.                                           
                                                                        
       SPECIAL-NAMES.                                                   
           DECIMAL-POINT IS COMMA.                                      
                                                                        
       INPUT-OUTPUT SECTION.                                            
       FILE-CONTROL.                                                    
             SELECT ENTRADA ASSIGN DDENTRA                              
                    FILE STATUS IS FS-ENT.                              
                                                                        
       DATA DIVISION.                                                   
       FILE SECTION.                                                    
       FD ENTRADA                                                       
            BLOCK CONTAINS 0 RECORDS                                    
            RECORDING MODE IS F.                                        
                                                                        
       01 REG-ENTRADA    PIC X(20).                                     
                                                                        
      **************************************                            
       WORKING-STORAGE SECTION.                                         
      **************************************                            
                                                                        
       77  FS-ENT          PIC XX                VALUE SPACES.          
                                                                        
       77  WS-STATUS-FIN   PIC X.                                       
           88  WS-FIN-LECTURA                    VALUE 'Y'.             
           88  WS-NO-FIN-LECTURA                 VALUE 'N'.             
                                                                        
       77  WS-SUC-NRO-ANT      PIC 999           VALUE ZEROS.           
       77  WS-CANT-TIPC1       PIC 9(2)          VALUE ZEROS.           
       77  WS-SUC-TIPC1-ANT    PIC 999           VALUE ZEROS.           
       77  WS-CANT-SUC         PIC 9(3)          VALUE ZEROS.           
       77  WS-TOT-CUENTAS      PIC S9(9)V99      VALUE ZEROS.           
       77  WS-SUMA-SUC         PIC S9(9)V99      VALUE ZEROS.           
       77  WS-SUMA-TIPC1       PIC S9(8)V99      VALUE ZEROS.           
                                                                        
       77  WS-TOT-PRINT        PIC -ZZZ.ZZZ.ZZ9,99 VALUE ZEROS.         
       77  WS-SUC-PRINT        PIC ZZ9            VALUE ZEROS.          
       77  WS-TIPO-PRINT       PIC ZZ9            VALUE ZEROS.          
                                                                        
           COPY CORTE.                                                  
                                                                        
      *****************************************************             
       PROCEDURE DIVISION.                                              
      *****************************************************             
                                                                        
      **************************************                            
      *                                    *                            
      *  CUERPO PRINCIPAL DEL PROGRAMA     *                            
      *                                    *                            
      **************************************                            
       MAIN-PROGRAM-INICIO.                                             
                                                                        
           PERFORM 1000-I-INICIO  
              THRU 1000-F-INICIO.                   
                                                                        
           PERFORM 2000-I-PROCESO 
              THRU 2000-F-PROCESO                  
              UNTIL WS-FIN-LECTURA.                 
                                                                        
           PERFORM 9999-I-FINAL 
              THRU 9999-F-FINAL.                 
                                                                        
       MAIN-PROGRAM-FINAL. GOBACK.                                      
                                                                        
      **************************************                            
       1000-I-INICIO.                                                   
      **************************************                            
                                                                        
           SET WS-NO-FIN-LECTURA TO TRUE.                               
                                                                        
           OPEN INPUT  ENTRADA.                                         
           IF FS-ENT IS NOT EQUAL '00'                                  
              DISPLAY '* ERROR EN OPEN ENTRADA INICIO = ' FS-ENT        
              SET  WS-FIN-LECTURA TO TRUE                               
           END-IF.                                                      
                                                                        
      * LEER EL PRIMER REGISTRO FUERA DEL LOOP PRINCIPAL                
                                                                        
           PERFORM 2500-I-LEER THRU 2500-F-LEER.                        
                                                                        
           IF WS-FIN-LECTURA                                            
              DISPLAY '* ARCHIVO ENTRADA VAC�O EN INICIO' FS-ENT        
           ELSE                                                         
                                                                        
              MOVE WS-SUC-NRO TO WS-SUC-NRO-ANT                         
              MOVE WS-SUC-TIPC1 TO WS-SUC-TIPC1-ANT                     
              ADD 1 TO WS-CANT-SUC                                      
              ADD 1 TO WS-CANT-TIPC1                                    
              ADD WS-SUC-IMPORTE  TO WS-SUMA-SUC  WS-SUMA-TIPC1         
              MOVE WS-SUC-NRO TO WS-SUC-PRINT                           
              DISPLAY '--------------------------------'                
              DISPLAY 'SUCURSAL = ' WS-SUC-PRINT                        
              DISPLAY '--------------------------------'                
           END-IF.                                                      
                                                                        
       1000-F-INICIO. EXIT.                                             
                                                                        
      **************************************                            
       2000-I-PROCESO.                                                  
      **************************************                            
                                                                        
           PERFORM 2500-I-LEER THRU 2500-F-LEER                         
                                                                        
           IF WS-FIN-LECTURA                                            
                PERFORM 2300-CORTE-SUC     THRU 2300-F-CORTE-SUC        
           ELSE                                                         
              IF WS-SUC-NRO EQUAL WS-SUC-NRO-ANT                        
                ADD 1 TO WS-CANT-SUC                                    
                ADD WS-SUC-IMPORTE  TO WS-SUMA-SUC                      
                   IF WS-SUC-TIPC1 EQUAL WS-SUC-TIPC1-ANT               
                      ADD 1 TO WS-CANT-TIPC1                            
                      ADD WS-SUC-IMPORTE  TO WS-SUMA-TIPC1              
                   ELSE                                                 
                      PERFORM 2600-CORTE-TIPC THRU 2600-F-CORTE-TIPC    
                   END-IF                                               
              ELSE                                                      
                  PERFORM 2300-CORTE-SUC     THRU 2300-F-CORTE-SUC      
              END-IF                                                    
           END-IF.                                                      
                                                                        
       2000-F-PROCESO. EXIT.                                            
                                                                        
      *************  CORTE DE CONTROL POR SUCURSAL *******              
       2300-CORTE-SUC.                                                  
      ****************************************************              
                                                                        
           PERFORM 2600-CORTE-TIPC THRU 2600-F-CORTE-TIPC               
           MOVE WS-SUMA-SUC    TO WS-TOT-PRINT                          
           DISPLAY 'TOTAL IMPORTE    EN SUCURSAL = ' WS-TOT-PRINT       
           ADD WS-SUMA-SUC     TO WS-TOT-CUENTAS                        
           MOVE WS-SUC-NRO     TO WS-SUC-NRO-ANT                        
           MOVE WS-SUC-NRO-ANT TO WS-SUC-NRO                            
           IF NOT WS-FIN-LECTURA                                        
             DISPLAY '--------------------------------'                 
             DISPLAY 'SUCURSAL = ' WS-SUC-NRO                           
             DISPLAY '--------------------------------'                 
           END-IF.                                                      
           MOVE 1 TO WS-CANT-SUC                                        
           MOVE 1 TO WS-CANT-TIPC1                                      
           MOVE WS-SUC-TIPC1   TO WS-SUC-TIPC1-ANT.                     
           MOVE WS-SUC-IMPORTE TO WS-SUMA-SUC.                          
                                                                        
       2300-F-CORTE-SUC. EXIT.                                          
                                                                        
                                                                        
      **************************************                            
       2500-I-LEER.                                                     
      **************************************                            
             READ ENTRADA INTO WS-REG-SUCURSAL                          
                                                                        
             EVALUATE FS-ENT                                            
               WHEN '00'                                                
                CONTINUE                                                
                                                                        
               WHEN '10'                                                
                SET WS-FIN-LECTURA TO TRUE                              
                                                                        
               WHEN OTHER                                               
                DISPLAY '*ERROR EN LECTURA ENTRADA INICIO : ' FS-ENT    
                SET WS-FIN-LECTURA TO TRUE                              
                                                                        
             END-EVALUATE.                                              
                                                                        
       2500-F-LEER. EXIT.                                               
                                                                        
      *************  CORTE DE CONTROL POR TIPC1  *********              
       2600-CORTE-TIPC.                                                 
      ****************************************************              
                                                                        
           MOVE WS-SUMA-TIPC1 TO WS-TOT-PRINT                           
           DISPLAY 'TOTAL IMPORTE TIPO CUENTA  ' WS-SUC-TIPC1-ANT       
                                        ' '      WS-TOT-PRINT           
                                                                        
           MOVE WS-SUC-TIPC1 TO WS-SUC-TIPC1-ANT.                       
           MOVE WS-SUC-IMPORTE TO WS-SUMA-TIPC1.                        
                                                                        
                                                                        
       2600-F-CORTE-TIPC. EXIT.                                         
                                                                        
                                                                        
      ****************************************************              
       9999-I-FINAL.                                                    
      ****************************************************              
                                                                        
           MOVE WS-TOT-CUENTAS TO WS-TOT-PRINT                          
           DISPLAY '**********************************************'     
           DISPLAY 'TOTAL IMPORTE GENERAL        = ' WS-TOT-PRINT.      
                                                                        
           CLOSE ENTRADA                                                
              IF FS-ENT IS NOT EQUAL '00'                               
                DISPLAY '* ERROR EN CLOSE ENTRADA = '                   
                                            FS-ENT                      
                MOVE 9999 TO RETURN-CODE                                
                SET WS-FIN-LECTURA TO TRUE                              
             END-IF.                                                    
                                                                        
       9999-F-FINAL.  EXIT.                                             
                                                                        
      *                                                                 
