       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGMASN12.
      
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CLIENTES
           ASSIGN TO DDCLIEN
           FILE STATUS IS SW-FS-CLIENTES.
      
       DATA DIVISION.
       FILE SECTION.
       FD  CLIENTES
           BLOCK CONTAINS 0 RECORDS
           RECORDING MODE IS F.
       01  REC-CLIENTES              PIC X(50).
      
       WORKING-STORAGE SECTION.

       COPY CPCLIENS.
      
       01  SW-VALIDACIONES.
           05 SW-SUC-OK            PIC X(01).
              88 SW-SUC-VALIDA     VALUE 'S'.
              88 SW-SUC-INVALIDA   VALUE 'N'.
           05 SW-TIPO-OK           PIC X(01).
              88 SW-TIPO-VALIDO    VALUE 'S'.
              88 SW-TIPO-INVALIDO  VALUE 'N'.
      
       01  WS-DIS-CLIENTES.
           05 FILLER                PIC X(05) VALUE SPACES.
           05 WS-DIS-TIPO-DESC      PIC X(20).
           05 FILLER                PIC X(05) VALUE SPACES.
           05 WS-DIS-IMP            PIC $$$,$$$,$99.
      
       01  SW-FS-CLIENTES           PIC X(02).
           88 SW-FS-OK              VALUE '00'.
           88 SW-FS-EOF             VALUE '10'.
           88 SW-FS-NOK             VALUE '01' THRU '09'
                                         '11' THRU '99'.
      
       01  WS-VARIABLES.
           05 WS-SUC-ANT            PIC 9(02).
           05 WS-TIPO-ANT           PIC 9(02).
           05 WS-NUM-EDI            PIC $$$,$$$,$99.
      
       01  AC-ACUMULADORES.
           05 AC-IMP-TIPO           PIC S9(11)V99 COMP-3.
           05 AC-IMP-SUC            PIC S9(11)V99 COMP-3.
           05 AC-IMP-TOT            PIC S9(11)V99 COMP-3.
      
       01  CN-CONTADORES.
           05 CN-REG-TIPO           PIC 9(05).
           05 CN-REG-SUC            PIC 9(05).
           05 CN-REG-TOT            PIC 9(05).

       01  WS-TITLES.
           05 WS-TIT-TIPO           PIC X(30).
           05 WS-TIT-SUC            PIC X(30).
      
       01  CO-SEPARADO1             PIC X(120) VALUE ALL '-'.
       01  CO-SEPARADOR             PIC X(120) VALUE ALL '='.
      
       01  WS-TIPO-DESC-TAB.
           05 FILLER                PIC X(20) VALUE 'Cta. Corriente'.
           05 FILLER                PIC X(20) VALUE 'Caja de Ahorro'.
           05 FILLER                PIC X(20) VALUE 'Plazo Fijo'.
       01  WS-TIPO-DESC REDEFINES WS-TIPO-DESC-TAB.
           05 WS-DESC-TIPO          PIC X(20) OCCURS 3.
      
       PROCEDURE DIVISION.
       0000-CONTROL.
           PERFORM 1000-I-INICIO
              THRU 1000-F-INICIO
      
           PERFORM 2000-I-PROCESO
              THRU 2000-F-PROCESO
      
           PERFORM 3000-I-FINAL
              THRU 3000-F-FINAL
      
           GOBACK
           .
      
       1000-I-INICIO.
           OPEN INPUT CLIENTES
           IF NOT SW-FS-OK
              DISPLAY '* Error En Open  CLIENTES= ' SW-FS-CLIENTES
              MOVE 9999 TO RETURN-CODE
           END-IF
           .
       1000-F-INICIO.
           EXIT
           .
      
       2000-I-PROCESO.
           INITIALIZE AC-ACUMULADORES CN-CONTADORES
           READ CLIENTES INTO REG-CLIENTES
           
           PERFORM UNTIL SW-FS-EOF OR SW-FS-NOK
              PERFORM 2100-VALIDA-DATOS
              
              IF SW-SUC-VALIDA
                 MOVE CLIS-SUC      TO WS-SUC-ANT
                 MOVE 0             TO AC-IMP-SUC
                 
                 DISPLAY 'Sucursal ' WS-SUC-ANT
                 
                 PERFORM UNTIL SW-FS-EOF OR SW-FS-NOK
                           OR CLIS-SUC NOT = WS-SUC-ANT
                    
                    PERFORM 2100-VALIDA-DATOS
                    IF SW-SUC-VALIDA AND SW-TIPO-VALIDO
                       MOVE CLIS-TIPO  TO WS-TIPO-ANT
                       MOVE 0          TO AC-IMP-TIPO
                       
                       PERFORM UNTIL SW-FS-EOF OR SW-FS-NOK
                                 OR CLIS-SUC NOT = WS-SUC-ANT
                                 OR CLIS-TIPO NOT = WS-TIPO-ANT
                          
                          PERFORM 2100-VALIDA-DATOS
                          IF SW-SUC-VALIDA AND SW-TIPO-VALIDO
                             ADD CLIS-IMPORTE TO AC-IMP-TIPO
                             ADD CLIS-IMPORTE TO AC-IMP-SUC
                             ADD CLIS-IMPORTE TO AC-IMP-TOT
                          END-IF
                          READ CLIENTES INTO REG-CLIENTES
                       END-PERFORM
                       
                       MOVE AC-IMP-TIPO TO WS-DIS-IMP
                       MOVE WS-DESC-TIPO(WS-TIPO-ANT) 
                         TO WS-DIS-TIPO-DESC
                       DISPLAY '     ' WS-DIS-CLIENTES
                    ELSE
                       READ CLIENTES INTO REG-CLIENTES
                    END-IF
                 END-PERFORM
                 
                 MOVE AC-IMP-SUC    TO WS-DIS-IMP
                 MOVE 'Total Sucursal' TO WS-DIS-TIPO-DESC
                 DISPLAY WS-DIS-CLIENTES
              ELSE
                 READ CLIENTES INTO REG-CLIENTES
              END-IF
           END-PERFORM
           
           MOVE AC-IMP-TOT         TO WS-DIS-IMP
           MOVE 'Total General'     TO WS-DIS-TIPO-DESC
           DISPLAY WS-DIS-CLIENTES
           .
       2000-F-PROCESO.
           EXIT
           .
      
       3000-I-FINAL.
           CLOSE CLIENTES
           IF NOT SW-FS-OK
              DISPLAY '* Error En Close CLIENTES= ' SW-FS-CLIENTES
           END-IF
           .
       3000-F-FINAL.
           EXIT.
       2100-VALIDA-DATOS.
           SET SW-SUC-INVALIDA     TO TRUE
           SET SW-TIPO-INVALIDO    TO TRUE
           
           IF CLIS-SUC >= 01 AND CLIS-SUC <= 10
              SET SW-SUC-VALIDA    TO TRUE
           END-IF
           
           IF CLIS-TIPO >= 01 AND CLIS-TIPO <= 03
              SET SW-TIPO-VALIDO   TO TRUE
           END-IF
           .
