       IDENTIFICATION DIVISION.                                         
        PROGRAM-ID PGMTABL2.                                            
      **************************************                            
      *                                    *                            
      *  PROGRAMA PARA GENERAR UNA TABLA   *                            
      *  EN WORKING CON TABLA DE 2 D       *                            
      *                                    *                            
      **************************************                            
      *      MANTENIMIENTO DE PROGRAMA     *                            
      **************************************                            
      *  FECHA   *    DETALLE        * COD *                            
      **************************************                            
      *          *                   *     *                            
      *          *                   *     *                            
      **************************************                            
       ENVIRONMENT DIVISION.                                            
       INPUT-OUTPUT SECTION.                                            
       FILE-CONTROL.                                                    
             SELECT ENTRADA ASSIGN DDENTRA                              
                    FILE STATUS IS WS-ENT-CODE.                         
                                                                        
             SELECT SALIDA  ASSIGN DDSALID                              
                    FILE STATUS IS WS-SAL-CODE.                         
                                                                        
       DATA DIVISION.                                                   
       FILE SECTION.                                                    
       FD ENTRADA                                                       
            BLOCK CONTAINS 0 RECORDS                                    
            RECORDING MODE IS F.                                        
                                                                        
       01 REG-ENTRADA    PIC X(80).                                     
                                                                        
       FD SALIDA                                                        
            BLOCK CONTAINS 0 RECORDS                                    
            RECORDING MODE IS F.                                        
                                                                        
       01 REG-SALIDA     PIC X(30).                                     
                                                                        
      **************************************                            
       WORKING-STORAGE SECTION.                                         
      **************************************                            
       77  FILLER        PIC X(26) VALUE '* INICIO WORKING-STORAGE *'.  
       77  FILLER        PIC X(26) VALUE '* CODIGOS RETORNO FILES  *'.  
       77  WS-ENT-CODE      PIC XX    VALUE SPACES.                     
       77  WS-SAL-CODE      PIC XX    VALUE SPACES.                     
       77  WS-SAL-CODES     PIC $*****,**** VALUE ZEROS.                
                                                                        
       01  WS-STATUS-FIN    PIC X.                                      
           88  WS-FIN-LECTURA         VALUE 'Y'.                        
           88  WS-NO-FIN-LECTURA      VALUE 'N'.                        
                                                                        
       77  FILLER       PIC X(26) VALUE '* LAYOUT ENTRADA MESES   *'.   
      **************************************                            
       01  WS-REG-ENTRADA.                                              
           03  WS-NRO-MES          PIC 9(2)    VALUE ZEROS.             
           03  WS-NOMBRE-MES       PIC X(10)   VALUE SPACES.            
           03  FILLER              PIC X(68)   VALUE SPACES.            
      **************************************                            
      *        COPY WSMESES.                                            
      **************************************                            
                                                                        
       01  WS-REG-SALIDA.                                               
           03  WS-SAL-NRO-MES          PIC 99      VALUE ZEROS.         
           03  WS-SAL-NOMBRE-MES       PIC X(10)   VALUE SPACES.        
           03  WS-SAL-NRO-DIA          PIC 99      VALUE ZEROS.         
           03  FILLER                  PIC X(16)   VALUE SPACES.        
                                                                        
                                                                        
       01  WS-DIAS.                                                     
             05  FILLER    PIC 99                VALUE 31.              
             05  FILLER    PIC 99                VALUE 28.              
             05  FILLER    PIC 99                VALUE 31.              
             05  FILLER    PIC 99                VALUE 30.              
             05  FILLER    PIC 99                VALUE 31.              
             05  FILLER    PIC 99                VALUE 30.              
             05  FILLER    PIC 99                VALUE 31.              
             05  FILLER    PIC 99                VALUE 31.              
             05  FILLER    PIC 99                VALUE 30.              
             05  FILLER    PIC 99                VALUE 31.              
             05  FILLER    PIC 99                VALUE 30.              
             05  FILLER    PIC 99                VALUE 31.              
       01 WS-TAB-DIAS     REDEFINES WS-DIAS.                            
          03 WS-ITEM-DIAS    PIC 99     OCCURS 12 TIMES.                
                                                                        
       77  WS-REMAINDER         PIC 9(2)        VALUE     ZEROS.        
       77  WS-RESULTADO         PIC 9(2)        VALUE     ZEROS.        
                                                                        
      ********     FECHA DE PROCESO ***************                     
       01  WS-FECHA.                                                    
           03  WS-FECHA-AAAA    PIC 9999          VALUE ZEROS.          
           03  WS-FECHA-MM      PIC 99            VALUE ZEROS.          
           03  WS-FECHA-DD      PIC 99            VALUE ZEROS.          
                                                                        
      *************************************************************     
      *        PROPUESTA DE SOLUCI�N EN CLASE                           
      *        ------------------------------                           
      *        DEFINICI�N DE TABLA (2 DIMENSIONES)                      
      *        PARA GUARDAR LOS 25 PRIMEROS N�MEROS CONSECUTIVOS        
      **************************************************************    
       01 WS-TABLE.                                                     
      *                                                                 
          05 WS-FILA OCCURS 5 TIMES  INDEXED BY WS-I.                   
             10 WS-ITEM-FILA       PIC 9(2).                            
                                                                        
             10  WS-COLUMNA OCCURS 5 TIMES  INDEXED BY WS-J.            
                 15  WS-ITEM-COLUMNA     PIC 9(2).                      
                                                                        
       77  WS-NUMERO           PIC 9(2)   VALUE  ZEROS.                 
       77  WS-INDICE           PIC 9(2)   VALUE ZEROS.                  
      *                                                                 
      ***************************************************************   
                                                                        
       77  FILLER              PIC X(26) VALUE                          
                                         '* FINAL  WORKING-STORAGE *'.  
                                                                        
      ***************************************************************.  
       PROCEDURE DIVISION.                                              
      **************************************                            
      *                                    *                            
      *  CUERPO PRINCIPAL DEL PROGRAMA     *                            
      *                                    *                            
      **************************************                            
       MAIN-PROGRAM.                                                    
                                                                        
           PERFORM 1000-INICIO  THRU   F-1000-INICIO.                   
                                                                        
           PERFORM 2000-PROCESO  THRU  F-2000-PROCESO                   
                   UNTIL WS-FIN-LECTURA.                                
                                                                        
           PERFORM 9999-FINAL    THRU  F-9999-FINAL.                    
                                                                        
       F-MAIN-PROGRAM. GOBACK.                                          
                                                                        
      **************************************                            
      *                                    *                            
      *  CUERPO INICIO APERTURA ARCHIVOS   *                            
      *                                    *                            
      **************************************                            
       1000-INICIO.                                                     
           ACCEPT WS-FECHA FROM DATE.                                   
                                                                        
      **************************************                            
      **   CALCULO A#O BISIESTO            *                            
      **************************************                            
           DIVIDE WS-FECHA-AAAA BY 4 GIVING WS-RESULTADO                
               REMAINDER   WS-REMAINDER                                 
                                                                        
           IF WS-REMAINDER = ZEROS                                      
               MOVE 29      TO WS-ITEM-DIAS(2)                          
           END-IF                                                       
                                                                        
      *    SET WS-STATUS-FIN TO 'N'.                                    
           SET WS-NO-FIN-LECTURA TO TRUE.                               
                                                                        
           OPEN INPUT  ENTRADA.                                         
           IF WS-ENT-CODE IS NOT EQUAL '00'                             
              DISPLAY '* ERROR EN OPEN ENTRADA = ' WS-ENT-CODE          
              MOVE 9999 TO RETURN-CODE                                  
              SET  WS-FIN-LECTURA TO TRUE                               
           END-IF.                                                      
                                                                        
           OPEN OUTPUT SALIDA.                                          
           IF WS-SAL-CODE IS NOT EQUAL '00'                             
              DISPLAY '* ERROR EN OPEN SALIDA  = ' WS-SAL-CODE          
              MOVE 9999 TO RETURN-CODE                                  
              SET  WS-FIN-LECTURA TO TRUE                               
           END-IF.                                                      
                                                                        
       F-1000-INICIO.   EXIT.                                           
                                                                        
      **************************************                            
      *                                    *                            
      *  CUERPO PRINCIPAL DE PROCESOS      *                            
      *  LECTURA FILE MESES CLASIFICADO    *                            
      *  GRABACION SALIDA CON LOS CAMPOS   *                            
      *            NUMERO       DE MES     *                            
      *            NOMBRE MES              *                            
      *            CANTIDAD DIAS           *                            
      *                                    *                            
      **************************************                            
       2000-PROCESO.                                                    
           READ ENTRADA INTO WS-REG-ENTRADA                             
                        AT END SET WS-FIN-LECTURA TO TRUE.              
                                                                        
           EVALUATE WS-ENT-CODE                                         
             WHEN '00'                                                  
           PERFORM 2200-SEGUIR-PROCESO THRU F-2200-SEGUIR-PROCESO       
                                                                        
              WHEN '10'                                                 
              SET WS-FIN-LECTURA TO TRUE                                
              SET WS-I TO 1                                             
              SET WS-J TO 1                                             
              PERFORM 2300-ARMAR-TABLA  THRU F-2300-ARMAR-TABLA         
                  VARYING WS-INDICE FROM 1 BY 1                         
                                        UNTIL WS-INDICE > 25            
                                                                        
           WHEN OTHER                                                   
              DISPLAY '* ERROR EN LECTURA ENTRADA = ' WS-ENT-CODE       
              MOVE 9999 TO RETURN-CODE                                  
              SET WS-FIN-LECTURA TO TRUE                                
                                                                        
           END-EVALUATE.                                                
                                                                        
                                                                        
       F-2000-PROCESO. EXIT.                                            
                                                                        
       2200-SEGUIR-PROCESO.                                             
                                                                        
           MOVE SPACES          TO     WS-REG-SALIDA                    
                                                                        
           MOVE WS-NRO-MES      TO     WS-SAL-NRO-MES                   
           MOVE WS-NOMBRE-MES   TO     WS-SAL-NOMBRE-MES                
                                                                        
           MOVE WS-ITEM-DIAS (WS-NRO-MES)   TO WS-SAL-NRO-DIA           
                                                                        
           WRITE REG-SALIDA FROM WS-REG-SALIDA                          
           IF WS-SAL-CODE IS NOT EQUAL '00'                             
                DISPLAY '* ERROR EN WRITE SALIDA  = '                   
                                            WS-SAL-CODE                 
                MOVE 9999 TO RETURN-CODE                                
                SET WS-FIN-LECTURA TO TRUE                              
           END-IF.                                                      
                                                                        
       F-2200-SEGUIR-PROCESO. EXIT.                                     
                                                                        
      **************************************                            
      * ARMAR TABLA DE 2 DIMENSIONES       *                            
      **************************************                            
       2300-ARMAR-TABLA. EXIT.                                          
           MOVE WS-INDICE TO WS-COLUMNA (WS-I WS-J).                    
           SET WS-I UP BY 1.                                            
           SET WS-J UP BY 1.                                            
                                                                        
       F-2300-ARMAR-TABLA. EXIT.                                        
                                                                        
      **************************************                            
      *                                    *                            
      *  CUERPO FINAL CIERRE DE FILES      *                            
      *                                    *                            
      **************************************                            
       9999-FINAL.                                                      
           CLOSE ENTRADA                                                
              IF WS-ENT-CODE IS NOT EQUAL '00'                          
                DISPLAY '* ERROR EN CLOSE ENTRADA = '                   
                                            WS-ENT-CODE                 
                MOVE 9999 TO RETURN-CODE                                
                SET WS-FIN-LECTURA TO TRUE                              
             END-IF.                                                    
                                                                        
           CLOSE  SALIDA                                                
              IF WS-SAL-CODE IS NOT EQUAL '00'                          
                DISPLAY '* ERROR EN CLOSE SALIDA   ='                   
                                            WS-SAL-CODE                 
                MOVE 9999 TO RETURN-CODE                                
                SET WS-FIN-LECTURA TO TRUE                              
           END-IF.                                                      
                                                                        
                                                                        
       F-9999-FINAL.                                                    
           EXIT.                                                        
      *                                                                 
