       IDENTIFICATION DIVISION.                                         
       PROGRAM-ID. PGMTABL3.                                            
      **************************************                            
      *                                    *                            
      *  PROGRAMA PARA GENERAR UNA TABLA   *                            
      *  EN WORKING CON TABLA DE 3 D       *                            
      *  ARREGLO DE 3 DIMENSIONES:         *                            
      *  PAGINAS:  7 DIAS DE LA SEMANA     *
      *  COLUMNAS: 5 SECTORES              *                            
      *  FILAS   : 10 ACTIVIDADES          *                            
      **************************************                            
      *      MANTENIMIENTO DE PROGRAMA     *                            
      **************************************                            
      *  FECHA   *    DETALLE        * COD *                            
      **************************************                            
      *          *                   *     *                            
      *          *                   *     *                            
      **************************************                            
       ENVIRONMENT DIVISION.                                            
       INPUT-OUTPUT SECTION.                                            
       FILE-CONTROL.                                                    
                                                                        
       DATA DIVISION.                                                   
       FILE SECTION.                                                    
                                                                        
      **************************************                            
       WORKING-STORAGE SECTION.                                         
      **************************************                            
       77  FILLER        PIC X(26) VALUE '* INICIO WORKING-STORAGE *'.  
      **************************************                            
                                                                        
                                                                        
      ********     FECHA DE PROCESO ***************                     
       01  WS-FECHA.                                                    
           03  WS-FECHA-AAAA    PIC 9999          VALUE ZEROS.          
           03  WS-FECHA-MM      PIC 99            VALUE ZEROS.          
           03  WS-FECHA-DD      PIC 99            VALUE ZEROS.          
                                                                        
      *************************************************************     
      *        PROPUESTA DE SOLUCION EN CLASE                           
      *        ------------------------------                           
      *        DEFINICION DE TABLA (3 DIMENSIONES)                      
      *        CLASE 17 TRAMO 1                                         
      **************************************************************    
       01 WS-TABLA.                                                     
      *                                                                 
          03 WS-PAGINA         OCCURS 5  TIMES.                         
             05 WS-ITEM-PAGINA              PIC X(10).                  
                                                                        
             05 WS-FILA        OCCURS 5  TIMES.                         
                07 WS-ITEM-FILA             PIC X(12).                  
                                                                        
                07  WS-COLUMNA OCCURS 10 TIMES.                         
                    09  WS-ITEM-COLUMNA     PIC X(20).                  
                                                                        
       77  WS-I           PIC 99                VALUE ZEROS.            
       77  WS-J           PIC 99                VALUE ZEROS.            
       77  WS-K           PIC 99                VALUE ZEROS.            
      *77  WS-MARCA-TI    PIC 9                 VALUE ZEROS.            
      *77  WS-MARCA-TJ    PIC 9                 VALUE ZEROS.            
      **************************************************************    
      * 7 DIAS DE LA SEMANA (PAGINA - INDICE WS-I)                 *    
      **************************************************************    
       01  WS-DIAS.                                                     
             05  FILLER    PIC X(10)             VALUE 'LUNES     '.    
             05  FILLER    PIC X(10)             VALUE 'MARTES    '.    
             05  FILLER    PIC X(10)             VALUE 'MIERCOLES '.    
             05  FILLER    PIC X(10)             VALUE 'JUEVES    '.    
             05  FILLER    PIC X(10)             VALUE 'VIERNES   '.    
       01 WS-TAB-DIAS     REDEFINES WS-DIAS.                            
          03 WS-ITEM-DIAS    PIC X(10)  OCCURS 5  TIMES.                
                                                                        
      **************************************************************    
      * 10 SECTORES         (FILA   - INDICE WS-J)                 *    
      **************************************************************    
       01 WS-SECTOR.                                                    
          03 FILLER           PIC X(12)  VALUE                          
                      ' FINANZAS  '.                                    
          03 FILLER           PIC X(12)  VALUE                          
                      ' CLIENTES  '.                                    
          03 FILLER           PIC X(12)  VALUE                          
                      ' INVERSIONES'.                                   
          03 FILLER           PIC X(12)  VALUE                          
                      ' PRESTAMOS  '.                                   
          03 FILLER           PIC X(12)  VALUE                          
                      ' INFORMATICA'.                                   
                                                                        
       01 WS-TAB-SECTOR   REDEFINES WS-SECTOR.                          
          03 WS-ITEM-SECTOR  PIC X(12)  OCCURS 5  TIMES.                
                                                                        
      **************************************************************    
      * 10 ACTIVIDADES      (COLUMNA- INDICE WS-K)                 *    
      **************************************************************    
       01 WS-ACTIVI-DADES.                                              
          03 FILLER           PIC X(20)  VALUE                          
                      '  ANALISIS          '.                           
          03 FILLER           PIC X(20)  VALUE                          
                      '  PROCEDIMIENTOS    '.                           
          03 FILLER           PIC X(20)  VALUE                          
                      '  ATENCION          '.                           
          03 FILLER           PIC X(20)  VALUE                          
                      '  ACTUALIZACION    '.                           
          03 FILLER           PIC X(20)  VALUE                          
                      '  ADMINISTRACION  '.                             
          03 FILLER           PIC X(20)  VALUE                          
                      '  ASESORAMIENTO   '.                             
          03 FILLER           PIC X(20)  VALUE                          
                      '  PROMOCION       '.                             
          03 FILLER           PIC X(20)  VALUE                          
                      '  OTORGAMIENTO    '.                             
          03 FILLER           PIC X(20)  VALUE                          
                      '  DESARROLLO      '.                             
          03 FILLER           PIC X(20)  VALUE                          
                      '  PRODUCCION      '.                             
                                                                        
       01 WS-TAB-ACTIVI   REDEFINES WS-ACTIVI-DADES.                    
          03 WS-ITEM-ACTIVI  PIC X(20)  OCCURS 10 TIMES.                
                                                                        
      *                                                                 
      *  DEFINICI�N VARIABLES                                           
      *                                                                 
       77  WS-ES-X            PIC X     VALUE 'X'.                      
       77  WS-MARCA           PIC X.                                    
           88 WS-MARCA-SIGUE            VALUE ' '.                      
           88 WS-MARCA-FIN              VALUE 'F'.                      
                                                                        
       77  FILLER              PIC X(26) VALUE                          
                                         '* FINAL  WORKING-STORAGE *'.  
                                                                        
      ***************************************************************.  
       PROCEDURE DIVISION.                                              
      **************************************                            
      *                                    *                            
      *  CUERPO PRINCIPAL DEL PROGRAMA     *                            
      *                                    *                            
      **************************************                            
       MAIN-PROGRAM.                                                    
                                                                        
           PERFORM 1000-INICIO  THRU   F-1000-INICIO.                   
                                                                        
           PERFORM 2000-PROCESO  THRU  F-2000-PROCESO                   
                   UNTIL WS-MARCA-FIN.                                  
                                                                        
           PERFORM 9999-FINAL    THRU  F-9999-FINAL.                    
                                                                        
       F-MAIN-PROGRAM. GOBACK.                                          
                                                                        
      **************************************                            
      *                                    *                            
      *  CUERPO INICIO APERTURA ARCHIVOS   *                            
      *                                    *                            
      **************************************                            
       1000-INICIO.                                                     
           ACCEPT WS-FECHA FROM DATE.                                   
           SET WS-MARCA-SIGUE TO TRUE.                                  
                                                                        
       F-1000-INICIO.   EXIT.                                           
                                                                        
      **************************************                            
      *                                    *                            
      *  CUERPO PRINCIPAL DE PROCESOS      *                            
      *                                    *                            
      **************************************                            
       2000-PROCESO.                                                    
           PERFORM VARYING WS-K      FROM 1 BY 1                        
                                        UNTIL WS-K > 10                 
                                                                        
             PERFORM VARYING WS-J      FROM 1 BY 1                      
                                        UNTIL WS-J > 5                  
                                                                        
               PERFORM 2020-ARMAR  THRU F-2020-ARMAR                    
                       VARYING WS-I      FROM 1 BY 1                    
                                        UNTIL WS-I > 5                  
                                                                        
             END-PERFORM                                                
           END-PERFORM.                                                 
                                                                        
      * TABLA ARMADA                                                    
           SET WS-MARCA-FIN   TO TRUE.                                  
                                                                        
       F-2000-PROCESO. EXIT.                                            
                                                                        
                                                                        
       2020-ARMAR.                                                      
           IF  WS-I = 1                                                 
               PERFORM 2022-ES1   THRU F-2022-ES1                       
           ELSE                                                         
               IF  WS-I = 2                                             
                   PERFORM 2022-ES2   THRU F-2022-ES2                   
               ELSE                                                     
                   IF  WS-I = 3                                         
                       PERFORM 2022-ES3   THRU F-2022-ES3               
                   ELSE                                                 
                       IF  WS-I = 4                                     
                           PERFORM 2022-ES4   THRU F-2022-ES4           
                       ELSE                                             
                           PERFORM 2022-ES5   THRU F-2022-ES5           
                       END-IF                                           
                   END-IF                                               
               END-IF                                                   
           END-IF.                                                      
                                                                        
       F-2020-ARMAR. EXIT.                                              
                                                                        
       2022-ES1.                                                        
           IF  WS-J = 1 AND WS-K = 1                                    
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
               GO TO F-2022-ES1                                         
           END-IF.                                                      
                                                                        
           IF  WS-J = 2 AND WS-K = 3                                    
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
               GO TO F-2022-ES1                                         
           END-IF.                                                      
                                                                        
           IF  WS-J = 3 AND WS-K = 6                                    
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
               GO TO F-2022-ES1                                         
           END-IF.                                                      
                                                                        
           IF  WS-J = 5 AND (WS-K = 9 OR WS-K = 10)                     
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
           END-IF.                                                      
                                                                        
       F-2022-ES1. EXIT.                                                
                                                                        
       2022-ES2.                                                        
           IF  WS-J = 2 AND WS-K = 2                                    
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
               GO TO F-2022-ES2                                         
           END-IF.                                                      
                                                                        
           IF  WS-J = 2 AND WS-K = 4                                    
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
               GO TO F-2022-ES2                                         
           END-IF.                                                      
                                                                        
           IF  WS-J = 3 AND WS-K = 5                                    
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
               GO TO F-2022-ES2                                         
           END-IF.                                                      
                                                                        
           IF  WS-J = 4 AND WS-K = 8                                    
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
               GO TO F-2022-ES2                                         
           END-IF.                                                      
                                                                        
           IF  WS-J = 5 AND (WS-K = 9 OR WS-K = 10)                     
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
           END-IF.                                                      
                                                                        
       F-2022-ES2. EXIT.                                                
                                                                        
       2022-ES3.                                                        
           IF  WS-J = 1 AND WS-K = 1                                    
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
               GO TO F-2022-ES3                                         
           END-IF.                                                      
                                                                        
           IF  WS-J = 2 AND WS-K = 3                                    
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
               GO TO F-2022-ES3                                         
           END-IF.                                                      
                                                                        
           IF  WS-J = 4 AND WS-K = 8                                    
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
               GO TO F-2022-ES3                                         
           END-IF.                                                      
                                                                        
           IF  WS-J = 5 AND (WS-K = 9 OR WS-K = 10)                     
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
           END-IF.                                                      
                                                                        
       F-2022-ES3. EXIT.                                                
                                                                        
       2022-ES4.                                                        
           IF  WS-J = 2 AND WS-K = 2                                    
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
               GO TO F-2022-ES4                                         
           END-IF.                                                      
                                                                        
           IF  WS-J = 2 AND WS-K = 4                                    
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
               GO TO F-2022-ES4                                         
           END-IF.                                                      
                                                                        
           IF  WS-J = 3 AND WS-K = 5                                    
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
               GO TO F-2022-ES4                                         
           END-IF.                                                      
                                                                        
           IF  WS-J = 4 AND WS-K = 8                                    
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
               GO TO F-2022-ES4                                         
           END-IF.                                                      
                                                                        
           IF  WS-J = 5 AND (WS-K = 9 OR WS-K = 10)                     
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
           END-IF.                                                      
                                                                        
       F-2022-ES4. EXIT.                                                
                                                                        
       2022-ES5.                                                        
           IF  WS-J = 1 AND WS-K = 1                                    
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
               GO TO F-2022-ES5                                         
           END-IF.                                                      
                                                                        
           IF  WS-J = 2 AND WS-K = 4                                    
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
               GO TO F-2022-ES5                                         
           END-IF.                                                      
                                                                        
           IF  WS-J = 3 AND WS-K = 6                                    
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
               GO TO F-2022-ES5                                         
           END-IF.                                                      
                                                                        
           IF  WS-J = 4 AND WS-K = 7                                    
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
               GO TO F-2022-ES5                                         
           END-IF.                                                      
                                                                        
           IF  WS-J = 5 AND (WS-K = 9 OR WS-K = 10)                     
               MOVE WS-ES-X   TO WS-COLUMNA (WS-I WS-J WS-K)            
           END-IF.                                                      
                                                                        
       F-2022-ES5. EXIT.                                                
                                                                        
                                                                        
      **************************************                            
      *                                    *                            
      *  CUERPO FINAL CIERRE DE FILES      *                            
      *                                    *                            
      **************************************                            
       9999-FINAL.                                                      
      *    MOVE ZEROS            TO WS-MARCA-TI.                        
                                                                        
           PERFORM VARYING WS-I      FROM 1 BY 1                        
                                        UNTIL WS-I > 5                  
                                                                        
      *      MOVE ZEROS            TO WS-MARCA-TJ                       
             PERFORM VARYING WS-J      FROM 1 BY 1                      
                                        UNTIL WS-J > 5                  
                                                                        
               PERFORM VARYING WS-K      FROM 1 BY 1                    
                                        UNTIL WS-K > 10                 
                                                                        
                 IF WS-COLUMNA (WS-I WS-J WS-K)  = WS-ES-X              
      *            IF   WS-MARCA-TI = ZEROS  AND WS-MARCA-TJ            
      *               MOVE     1      TO WS-MARCA-TI                    
      *               MOVE     1      TO WS-MARCA-TJ                    
                      DISPLAY  WS-ITEM-DIAS    (WS-I)                   
                      DISPLAY  WS-ITEM-SECTOR  (WS-J)                   
                      DISPLAY  WS-ITEM-ACTIVI  (WS-K)                   
      *            ELSE                                                 
      *               IF WS-MARCA-TJ = ZEROS                            
      *                 MOVE     1      TO WS-MARCA-TJ                  
      *                 DISPLAY  WS-ITEM-DIAS    (WS-I)                 
      *                 DISPLAY  WS-ITEM-SECTOR  (WS-J)                 
      *                 DISPLAY  WS-ITEM-ACTIVI  (WS-K)                 
                 END-IF                                                 
                                                                        
               END-PERFORM                                              
             END-PERFORM                                                
           END-PERFORM.                                                 
                                                                        
       F-9999-FINAL.                                                    
           EXIT.                                                        
      *                                                                 
