       IDENTIFICATION DIVISION.
       PROGRAM-ID. CONCATENAR-NOMBRE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NOMBRE1        PIC X(10) VALUE "Daniel".
       01  NOMBRE2        PIC X(10) VALUE "Angel".
       01  NOMBRE3        PIC X(10) VALUE "Cazabat".
       01  NOMBRE-COMPLETO PIC X(32).

       PROCEDURE DIVISION.
           MOVE NOMBRE1 TO NOMBRE-COMPLETO
           STRING
               " " DELIMITED BY SIZE
               NOMBRE2 DELIMITED BY SPACE
               " " DELIMITED BY SIZE
               NOMBRE3 DELIMITED BY SPACE
               INTO NOMBRE-COMPLETO WITH POINTER
                   LENGTH OF NOMBRE1 + 1
           END-STRING

           DISPLAY NOMBRE-COMPLETO

           GOBACK.

