       IDENTIFICATION DIVISION.
       PROGRAM-ID.    PGMSUMA.
       AUTHOR.        D. CAZABAT.
       INSTALLATION.  CURSO CODEKI.
       DATE-WRITTEN.  04/11/2025.
       DATE-COMPILED. 04/11/2025.
       SECURITY.      UNCLASSIFIED.
       
       ENVIRONMENT DIVISION. 
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION. 

       PROCEDURE DIVISION.
       MAIN-PROGRAM.
           PERFORM 1000-I-INICIO.
           PERFORM 2000-I-PROCESO.
           PERFORM 9999-I-FINAL.
           GOBACK.

       1000-I-INICIO.
           DISPLAY "INICIO DEL PROGRAMA".

       2000-I-PROCESO.

       9999-I-FINAL.
           DISPLAY "FIN DEL PROGRAMA".

       
