       IDENTIFICATION DIVISION.
       PROGRAM-ID. SampleProgram.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
           DISPLAY 'Hello, World!'.
           STOP RUN.

