      **************************************                            
      *         LAYOUT SUCURSAL            *                            
      *     ALU9999.CURSOS.PRODUCTO        *                            
      *     LARGO REGISTRO = 25 BYTES      *                            
      **************************************                            
       01  WS-REG-PRODUCTO.                                             
                                                                        
      *     POSICI�N RELATIVA (1:3) C�DIGO DE PRODUCTO                  
           03  COD-PRODUCTO        PIC 9(03)    VALUE ZEROS.            
      *     POSICI�N RELATIVA (4:7)                                     
           03  COD-SUBPRODUCTO.                                         
              05  TIPO             PIC 99    VALUE ZEROS.               
              05  SUB-TIPO         PIC X(5)  VALUE SPACES.              
      *     POSICI�N RELATIVA (11:9)                                    
           03  PRECIO              PIC  9(07)V99        VALUE ZEROS.    
      *     POSICI�N RELATIVA (20:06)                                   
           03  FILLER              PIC X(06)    VALUE SPACES.           
                                                                        
